Repository: openprocurement/openprocurement.auctions.appraisal
Catalog: docs/source/locale/*/LC_MESSAGES/overview.po
Languages: uk

source: Overview
uk: Огляд

source: Conventions
uk: Домовленості

source: If something went wrong during the request, we'll get a different status code and the JSON returned will have an `errors` field at the top level containing a list of problems. We look at the first one and print out its message.
uk: Якщо під час запиту виникли труднощі, ми отримаємо інший код стану та JSON, який при поверненні міститиме `errors` поле на верхньому рівні зі списком проблем. Ми дивимось на першу з них і видруковуємо її повідомлення.

source: Project status
uk: Стан проекту

source: The project has pre alpha status.
uk: Статус цього проекту пре-альфа.

source: Documentation of related packages
uk: Документація пов’язаних пакетів

source: API stability
uk: Стабільність API

source: API is relatively stable. The changes in the API are communicated via `Open Procurement API <https://groups.google.com/group/open-procurement-api>`_ maillist.
uk: API є відносно стабільним. Зміни в API обговорюються через `Open Procurement API <https://groups.google.com/group/open-procurement-api>`_ розсилку.

source: Next steps
uk: Наступні кроки

source: Features
uk: Особливості

source: You might find it helpful to look at the :ref:`tutorial`.
uk: Можливо вам буде цікаво прочитати :ref:`tutorial`.

source: All API POST and PUT requests expect a top-level object with a single element in it named `data`. Successful responses will mirror this format. The data element should itself be an object, containing the parameters for the request. In the case of creating a new auction, these are the fields we want to set on the auction itself.
uk: Всі API POST та PUT запити очікують об'єкт верхнього рівня з єдиним елементом з назвою `data`. Відповіді з повідомленням про успіх будуть віддзеркалювати цей формат. Елемент data повинен сам бути об’єктом, що містить параметри запиту. Якщо створюється новий аукціон, то це ті поля, які ми хочемо встановити на самому аукціоні.

source: If the request was successful, we will get a response code of `201` indicating the object was created. That response will have a data field at its top level, which will contain complete information on the new auction, including its ID.
uk: Якщо запит був успішним, ми отримаємо код відповіді `201`, який вказує, що об’єкт був створений. Ця відповідь буде мати data поле на верхньому рівні, яке вміщуватиме повну інформацію про новий аукціон, включно з ID.

source: API accepts `JSON <http://json.org/>`_ or form-encoded content in requests. It returns JSON content in all of its responses, including errors. Only the UTF-8 character encoding is supported for both requests and responses.
uk: API приймає `JSON <http://json.org/>`_ або form-encoded вміст у запитах. Він повертає JSON вміст у всіх свої відповідях, включно з помилками. Підтримується лише UTF-8 кодування і для запитів, і для відповідей.

source: Auction consists of 3 stages: Dutch auction, sealed bid and best bid parts.
uk: Аукціон проводиться у три етапи: Голландський аукціон, sealed bid та best bid частини.

source: *Auction.value* is gradually decreasing per 1% during the Dutch part.
uk: *Auction.value* поступово знижується на 1% протягом Голландського етапу.

source: In case of no bid has been made within Dutch auction, the whole procedure will be marked as unsuccessful.
uk: Якщо жоден учкасник не зробить цінової пропозиції під час Голландського аукціону, процедура вважається неуспішною.

source: Bids with the `value` mentioned will be rejected.
uk: Пропозиції з вказаним `value` будуть відхилені.

source: openprocurement.auctions.appraisal describes the process of insider auction.
uk: openprocurement.auctions.appraisal описує процес Голландського аукціону.

source: The procurementMethodType (type of the procedure) is **appraisal.insider**.
uk: procurementMethodType (тип процедури) - **appraisal.insider**.

source: The source repository for this project is on GitHub: `<https://github.com/openprocurement/openprocurement.auctions.appraisal>`_.
uk: Репозиторій цього проекту на GitHub: `<https://github.com/openprocurement/openprocurement.auctions.appraisal>`_.

source: The only date Organizer has to provide is a preferable day for the auction (``auctionPeriod.startDate``), the rest will be calculated automatically.
uk: Єдина дата, яку має вкзати Організатор - бажаний день аукціону (``auctionPeriod.startDate``). Всі решта дати вирахуються автоматично.

source: Bidders can enter the auction till the end of the Dutch part (tenderPeriod.endDate = auctionPeriod.startDate + Dutch part duration).
uk: Учасники можуть реєструватись на участь в аукціоні до кінця Голландської частини (tenderPeriod.endDate = auctionPeriod.startDate + Dutch part duration).
